IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_gpio_data_regs.xml
	<register id="GPHSET" width="32" page="1" offset="0x3a" internal="0" description="GPIO H Data Set Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCLEAR" width="32" page="1" offset="0x3c" internal="0" description="GPIO H Data Clear Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHTOGGLE" width="32" page="1" offset="0x3e" internal="0" description="GPIO H Data Toggle Register (GPIO224 to 255) ">
		<bitfield id="GPIO224" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Output Toggle bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Output Toggle bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
</module>
